Revit 2026 API

# FilteredElementCollectorOwnedByView Method

---

Applies an ElementOwnerViewFilter to the collector.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public FilteredElementCollector OwnedByView(
	ElementId viewId
)
```
```vb
Public Function OwnedByView (
	viewId As ElementId
) As FilteredElementCollector
```
```cpp
public:
FilteredElementCollector^ OwnedByView(
	ElementId^ viewId
)
```
```fsharp
member OwnedByView :
        viewId : ElementId -> FilteredElementCollector
```

#### Parameters

viewId ElementId
     The view id of the owner view.

#### Return Value

FilteredElementCollector A handle to this collector. This is the same collector that has just been modified, returned so you can chain multiple calls together in one line.

| Exception | Condition |
| --- | --- |
| ArgumentNullException | A non-optional argument was null |

Only elements that are owned by this particular view will pass the collector. If you have an active iterator to this collector it will be stopped by this call.

#### Reference

FilteredElementCollector Class

Autodesk.Revit.DB Namespace